{"modelTopology": {"training_config": {"metrics": ["accuracy"], "loss": "categorical_crossentropy", "optimizer_config": {"class_name": "Adamax", "config": {"beta_1": 0.8999999761581421, "epsilon": 1e-07, "beta_2": 0.9990000128746033, "lr": 0.009999999776482582, "decay": 0.0}}, "loss_weights": null, "sample_weight_mode": null}, "keras_version": "2.1.5", "model_config": {"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "dtype": "float32", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "batch_input_shape": [null, 200, 3], "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "kernel_constraint": null, "activation": "sigmoid", "stateful": false, "dropout": 0.0, "unit_forget_bias": true, "recurrent_regularizer": null, "name": "lstm_1", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "sigmoid", "stateful": false, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_2", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "dropout_2"}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "sigmoid", "stateful": false, "dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_3", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 6, "use_bias": true, "activity_regularizer": null}}]}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [64, 6], "name": "dense_1/kernel"}, {"dtype": "float32", "shape": [6], "name": "dense_1/bias"}]}, {"paths": ["group2-shard1of1"], "weights": [{"dtype": "float32", "shape": [3, 256], "name": "lstm_1/kernel"}, {"dtype": "float32", "shape": [64, 256], "name": "lstm_1/recurrent_kernel"}, {"dtype": "float32", "shape": [256], "name": "lstm_1/bias"}]}, {"paths": ["group3-shard1of1"], "weights": [{"dtype": "float32", "shape": [64, 256], "name": "lstm_2/kernel"}, {"dtype": "float32", "shape": [64, 256], "name": "lstm_2/recurrent_kernel"}, {"dtype": "float32", "shape": [256], "name": "lstm_2/bias"}]}, {"paths": ["group4-shard1of1"], "weights": [{"dtype": "float32", "shape": [64, 256], "name": "lstm_3/kernel"}, {"dtype": "float32", "shape": [64, 256], "name": "lstm_3/recurrent_kernel"}, {"dtype": "float32", "shape": [256], "name": "lstm_3/bias"}]}]}